Repository: maxbaydi/shadowsocks_win
Catalog: src/VibeShadowsocks.App/Resources/*/Resources.resw
Source language: en_us
Languages: ru_ru

# NavDashboard.Content
source: Dashboard
ru_ru: Панель

# NavServers.Content
source: Servers
ru_ru: Серверы

# NavRouting.Content
source: Routing / PAC
ru_ru: Маршрутизация

# NavSettings.Content
source: Settings
ru_ru: Настройки

# NavLogs.Content
source: Logs
ru_ru: Журнал

# DashboardTitle.Text
source: Dashboard
ru_ru: Панель управления

# ConnectBtnText.Text
source: Connect
ru_ru: Подключить

# DisconnectBtnText.Text
source: Disconnect
ru_ru: Отключить

# ActiveServerLabel.Text
source: Active Server
ru_ru: Активный сервер

# RoutingModeLabel.Text
source: Routing Mode
ru_ru: Режим маршрутизации

# DashboardErrorBar.Title
source: Error
ru_ru: Ошибка

# SettingsTitle.Text
source: Settings
ru_ru: Настройки

# SaveBtn.Content
source: Save
ru_ru: Сохранить

# ReloadBtn.Content
source: Reload
ru_ru: Обновить

# GeneralSection.Text
source: General
ru_ru: Общие

# AutoStartSwitch.Header
source: Start with Windows
ru_ru: Запускать с Windows

# AutoConnectSwitch.Header
source: Auto-connect on startup
ru_ru: Авто-подключение при запуске

# MinToTraySwitch.Header
source: Close button minimizes to tray
ru_ru: Кнопка закрытия сворачивает в трей

# SsLocalPathBox.Header
source: sslocal.exe path
ru_ru: Путь к sslocal.exe

# SsLocalPathBox.PlaceholderText
source: Leave empty for default (tools/sslocal/sslocal.exe)
ru_ru: Оставьте пустым для пути по умолчанию (tools/sslocal/sslocal.exe)

# BrowseBtn.Content
source: Browse...
ru_ru: Обзор...

# NetworkSection.Text
source: Network
ru_ru: Сеть

# SocksPortBox.Header
source: SOCKS port
ru_ru: Порт SOCKS

# PacPortBox.Header
source: PAC server port
ru_ru: Порт PAC сервера

# HotkeySection.Text
source: Hotkey
ru_ru: Горячая клавиша

# HotkeyBox.Header
source: Global hotkey (toggle connect/disconnect)
ru_ru: Глобальная горячая клавиша (переключение подключения)

# HotkeyBox.PlaceholderText
source: e.g. Ctrl+Alt+Shift+P
ru_ru: напр. Ctrl+Alt+Shift+P

# LoggingSection.Text
source: Logging
ru_ru: Журналирование

# LogLevelBox.Header
source: Log level
ru_ru: Уровень логирования

# LanguageSection.Text
source: Language
ru_ru: Язык

# LanguageBox.Header
source: Interface language
ru_ru: Язык интерфейса

# ServersTitle.Text
source: Servers
ru_ru: Серверы

# AddBtn.Content
source: Add
ru_ru: Добавить

# DeleteBtn.Content
source: Delete
ru_ru: Удалить

# SaveServersBtn.Content
source: Save
ru_ru: Сохранить

# SetActiveBtn.Content
source: Set Active
ru_ru: Сделать активным

# ServerDetailsTitle.Text
source: Server Details
ru_ru: Параметры сервера

# NameBox.Header
source: Name
ru_ru: Имя

# HostBox.Header
source: Host
ru_ru: Хост

# PortBox.Header
source: Port
ru_ru: Порт

# CipherBox.Header
source: Cipher method
ru_ru: Метод шифрования

# PasswordBox.Header
source: Password
ru_ru: Пароль

# GroupBox.Header
source: Group
ru_ru: Группа

# TagsBox.Header
source: Tags (comma separated)
ru_ru: Теги (через запятую)

# FavoriteSwitch.Header
source: Favorite
ru_ru: Избранное

# PluginBox.Header
source: Plugin
ru_ru: Плагин

# PluginBox.PlaceholderText
source: Optional (e.g. v2ray-plugin)
ru_ru: Опционально (напр. v2ray-plugin)

# PluginOptsBox.Header
source: Plugin options
ru_ru: Опции плагина

# PluginOptsBox.PlaceholderText
source: Optional
ru_ru: Опционально

# ImportExportTitle.Text
source: Import / Export
ru_ru: Импорт / Экспорт

# ImportUriBox.PlaceholderText
source: Paste ss:// link to import
ru_ru: Вставьте ss:// ссылку для импорта

# ImportBtn.Content
source: Import
ru_ru: Импорт

# ExportUriBox.Header
source: Exported URI
ru_ru: Экспортированный URI

# ExportBtn.Content
source: Export
ru_ru: Экспорт

# RoutingTitle.Text
source: Routing Rules
ru_ru: Правила маршрутизации

# SaveApplyBtnText.Text
source: Save & Apply
ru_ru: Сохранить и применить

# PacSourceSection.Text
source: PAC Source
ru_ru: Источник PAC

# RemotePacToggle.Header
source: Use remote PAC script instead of custom rules
ru_ru: Использовать удалённый PAC вместо своих правил

# RemotePacToggle.OnContent
source: Remote PAC URL
ru_ru: Удалённый PAC URL

# RemotePacToggle.OffContent
source: Custom Rules
ru_ru: Свои правила

# RemotePacSection.Text
source: Remote PAC Script
ru_ru: Удалённый PAC скрипт

# RemotePacDescription.Text
source: Paste a URL to a .pac file hosted online. The system will set this URL as the AutoConfig proxy. The PAC script decides which traffic goes through the proxy and which goes directly.
ru_ru: Вставьте URL .pac файла, размещённого в интернете. Система установит этот URL в качестве AutoConfig прокси. PAC скрипт определяет, какой трафик идёт через прокси, а какой — напрямую.

# PortCompatInfo.Title
source: Port compatibility
ru_ru: Совместимость портов

# PortCompatInfo.Message
source: The remote PAC script must use the same SOCKS port as configured in Settings (default: 1080). If ports don't match, the proxy won't work.
ru_ru: Удалённый PAC скрипт должен использовать тот же SOCKS порт, что указан в Настройках (по умолчанию: 1080). Если порты не совпадают, прокси работать не будет.

# HowItWorksInfo.Title
source: How it works
ru_ru: Как это работает

# HowItWorksInfo.Message
source: In PAC mode, traffic is routed based on these rules. Add domains to 'Proxied' to send them through the proxy, or to 'Direct' to bypass it.
ru_ru: В режиме PAC трафик маршрутизируется по этим правилам. Добавьте домены в «Через прокси» для направления через прокси, или в «Напрямую» для обхода.

# ProxiedDomainsTitle.Text
source: Proxied Domains
ru_ru: Проксируемые домены

# ProxiedDomainsDesc.Text
source: These domains will route through the Shadowsocks proxy
ru_ru: Эти домены будут направляться через Shadowsocks прокси

# DirectDomainsTitle.Text
source: Direct Domains (Bypass)
ru_ru: Прямые домены (обход)

# DirectDomainsDesc.Text
source: These domains will always connect directly, bypassing the proxy
ru_ru: Эти домены всегда подключаются напрямую, минуя прокси

# BehaviorSection.Text
source: Behavior
ru_ru: Поведение

# UnlistedSwitch.Header
source: Unlisted domains
ru_ru: Домены не из списков

# UnlistedSwitch.OnContent
source: Route through proxy
ru_ru: Через прокси

# UnlistedSwitch.OffContent
source: Connect directly
ru_ru: Напрямую

# BypassPrivateSwitch.Header
source: Bypass private addresses (10.x, 172.16.x, 192.168.x)
ru_ru: Обходить частные адреса (10.x, 172.16.x, 192.168.x)

# BypassSimpleSwitch.Header
source: Bypass simple hostnames (e.g. intranet)
ru_ru: Обходить простые имена хостов (напр. intranet)

# AdvancedExpander.Header
source: Advanced Settings
ru_ru: Дополнительные настройки

# PacProfileBox.Header
source: PAC Profile
ru_ru: PAC профиль

# RulesUrlBox.Header
source: Rules URL (auto-download additional rules)
ru_ru: URL правил (авто-загрузка доп. правил)

# TestUrlLabel.Text
source: Test URL
ru_ru: Тест URL

# TestBtn.Content
source: Test
ru_ru: Тест

# TestResultBox.PlaceholderText
source: Result
ru_ru: Результат

# PacPreviewLabel.Text
source: PAC Script Preview
ru_ru: Предпросмотр PAC скрипта

# LogsTitle.Text
source: Logs
ru_ru: Журнал

# RefreshBtnText.Text
source: Refresh
ru_ru: Обновить

# ExportDiagBtnText.Text
source: Export Diagnostics
ru_ru: Экспорт диагностики

# StateDisconnected
source: Disconnected
ru_ru: Отключено

# StateStarting
source: Starting
ru_ru: Подключение

# StateConnected
source: Connected
ru_ru: Подключено

# StateStopping
source: Stopping
ru_ru: Отключение

# StateFaulted
source: Error
ru_ru: Ошибка

# MsgStarting
source: Establishing connection...
ru_ru: Установка соединения...

# MsgConnected
source: Tunnel active
ru_ru: Туннель активен

# MsgStopping
source: Closing connection...
ru_ru: Закрытие соединения...

source: Settings loaded.
ru_ru: Настройки загружены.

source: Settings saved.
ru_ru: Настройки сохранены.

# HotkeyConflictFmt
source: Hotkey conflict: {0}
ru_ru: Конфликт горячей клавиши: {0}

# HotkeyEmpty
source: Hotkey string is empty.
ru_ru: Строка горячей клавиши пуста.

# HotkeyInvalid
source: Hotkey string is invalid.
ru_ru: Строка горячей клавиши недействительна.

# HotkeyMissingKey
source: Hotkey key part is missing.
ru_ru: Отсутствует основная клавиша.

source: Copy Diagnostics
ru_ru: Копировать диагностику

source: Copied!
ru_ru: Скопировано!

source: Ready to connect
ru_ru: Готов к подключению

# SelectServerFirst
source: Select a server first.
ru_ru: Сначала выберите сервер.

# ActiveServerFmt
source: Active server: {0}
ru_ru: Активный сервер: {0}

# ProfilesSaved
source: Server profiles saved.
ru_ru: Профили серверов сохранены.

# ImportedUri
source: Imported ss:// URI.
ru_ru: Импортирован ss:// URI.

# ImportFailedFmt
source: Import failed: {0}
ru_ru: Ошибка импорта: {0}

source: No profile selected.
ru_ru: Профиль не выбран.

source: Export complete.
ru_ru: Экспорт завершён.

# RemotePacSaved
source: Remote PAC URL saved and applied.
ru_ru: Удалённый PAC URL сохранён и применён.

# RulesSaved
source: Rules saved and applied.
ru_ru: Правила сохранены и применены.

# TestRemoteNA
source: Testing is not available for remote PAC scripts.
ru_ru: Тестирование недоступно для удалённых PAC скриптов.

# NoLogDirectory
source: No log directory yet.
ru_ru: Директория логов ещё не создана.

# NoLogFiles
source: No log files found.
ru_ru: Файлы логов не найдены.

# DiagnosticsExportedFmt
source: Diagnostics exported: {0}
ru_ru: Диагностика экспортирована: {0}

# NewServerName
source: New server
ru_ru: Новый сервер

# RestartForLanguage
source: Please restart the application to apply the language change.
ru_ru: Для смены языка необходимо перезапустить приложение.

# ErrorFmt
source: Error: {0}
ru_ru: Ошибка: {0}

# RemotePacFmt
source: Remote: {0}
ru_ru: Удалённый: {0}

# TrayConnect
source: Connect
ru_ru: Подключить

# TrayDisconnect
source: Disconnect
ru_ru: Отключить

# TrayRoutingMode
source: Routing Mode
ru_ru: Режим маршрутизации

# TrayOff
source: Off
ru_ru: Выкл

# TrayGlobal
source: Global
ru_ru: Глобальный

# TrayOpen
source: Open
ru_ru: Открыть

# TrayExit
source: Exit
ru_ru: Выход

# NotifConnected
source: Connected
ru_ru: Подключено

# NotifDisconnected
source: Disconnected
ru_ru: Отключено

# NotifError
source: Error
ru_ru: Ошибка

# NotifTunnelClosed
source: VPN tunnel closed
ru_ru: VPN-туннель закрыт

# NotifUnknownServer
source: Unknown
ru_ru: Неизвестно

# NotifServerFmt
source: Server: {0}
ru_ru: Сервер: {0}

# UpdateSection.Text
source: Updates
ru_ru: Обновления

# CheckUpdateBtn.Content
source: Check for updates
ru_ru: Проверить обновления

# InstallUpdateBtn.Content
source: Download & Install
ru_ru: Скачать и установить

# CurrentVersionFmt
source: Current version: {0}
ru_ru: Текущая версия: {0}

source: Checking for updates...
ru_ru: Проверка обновлений...

# UpdateAvailableFmt
source: Update available: v{0}
ru_ru: Доступно обновление: v{0}

# NoUpdates
source: You are using the latest version.
ru_ru: Вы используете последнюю версию.

# UpdateCheckFailed
source: Failed to check for updates.
ru_ru: Не удалось проверить обновления.

# Downloading
source: Downloading update...
ru_ru: Загрузка обновления...

# InstallingUpdate
source: Installing update and restarting...
ru_ru: Установка обновления и перезапуск...

# UpdateDownloadFailed
source: Failed to download update.
ru_ru: Не удалось загрузить обновление.

# NotifUpdateAvailableFmt
source: Update available: v{0}. Open Settings to install.
ru_ru: Доступно обновление: v{0}. Откройте Настройки для установки.

# TooltipCopyDiag
source: Copy diagnostics to clipboard
ru_ru: Скопировать диагностику в буфер обмена

# TooltipRefreshStatus
source: Refresh status
ru_ru: Обновить статус

# TooltipActiveServer
source: Active server
ru_ru: Активный сервер

# TooltipSetActive
source: Use selected server for connection
ru_ru: Использовать выбранный сервер для подключения

# TooltipAddDomain
source: Add domain
ru_ru: Добавить домен

# TooltipRemove
source: Remove
ru_ru: Удалить

# TooltipRefreshLogs
source: Refresh log view
ru_ru: Обновить журнал

# TooltipExportDiag
source: Export diagnostics bundle to Desktop
ru_ru: Экспортировать диагностику на Рабочий стол
